<?php require_once('../private/init.php'); ?>


<?php $page_title = 'About Us'; ?>
<?php include(SHARED_PATH . '/public_header.php'); ?>
<div id="main">

  <div id="" class="">
    <h2>حول</h2>
    <p>تعتمد جميع أدوات البرمجة الحديثة على مجموعة أحرف "أسكي" (ASCII)، التي تشفر الحروف اللاتينية وتستند في الأصل إلى اللغة الإنجليزية.

ونتيجة لذلك، أصبحت البرمجة مرتبطة بثقافة لغة واحدة، ويعتبر هذا تحيزا ثقافيا لأبناء تلك اللغة والذين يعرفون القراءة والكتابة بها أفضل من غيرهم. لذلك جاء مشروع "قلب" ليستكشف ويتحدى من خلال تقديم لغة تنحرف بالكامل تقريبا عن أحرف أسكي.
    <p>يواجه العديد من المبرمجين الطموحين غير الناطقين بالإنجليزية في العالم تحديات كبيره أثناء تعلمهم إحدى لغات البرمجة لما تحمله من تعقيد خاصه لغة الأحرف اللاتينية والرموز التي تكون في معظم الأحيان غامضة.

عرف المبرمج اللبناني رمزي ناصر هذا التحدي وتمكّن من تطوير لغة برمجة عربية بالكامل تحمل اسم "قلب"، وكشف عنها في المؤتمر السنوي لمركز "أي بييمز" (Eyebeam’s) في مدينة نيويورك الأميركية في عام 2013.

يقول ناصر لموقع أنيمال التقني إن "قلب" هي لغة برمجة لاستكشاف دور الثقافة البشرية في البرمجة. تتم كتابة الكود باللغة العربية بالكامل، ويتم تنفيذه بشكل متفرع على مترجم -أداة تحوّل رموز اللغات البرمجية إلى لغة آلية- معمول بواسطة جافا سكريبت.

وتاريخيا لم تكن أجهزة الحواسيب جيدة مع اللغة العربية فحتى برامج تحرير النصوص كانت لا تدعمها، علاوة على العديد من الصفحات الأخرى، ومع التطور التقني بات الكثير من المطورين يطمحون لتجاوز هذه المشاكل والرقي باللغة العربية.</p>
  </div>
  
</div>

<?php $super_hero_image = 'books-shelf.jpg'; ?>
<?php include(SHARED_PATH . '/public_footer.php'); ?>